taskt/Core/Automation/Commands/UIAutomationGroup/UIAutomationSelectUIElementCommand.puml
@startuml
UIAutomationSelectUIElementCommand --> AUIElementActionCommands
AUIElementActionCommands --> ADoSomethingUIElementCommands
AUIElementActionCommands --> IUIElementActionProperties
ADoSomethingUIElementCommands --> AUIElementCoreCommands
ADoSomethingUIElementCommands --> IDoSomethingUIElementProperties
AUIElementCoreCommands --> ScriptCommand
AUIElementCoreCommands --> IUIElementCoreProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
